#include <iostream>

using namespace std;
//---------------------Функции и Прототипы---------------------------------------


// По заданному вещественному x, вычислить корень кубический из x по следующей итерационной формуле :
// Y(i + 1) = 0.5 (yi + 3 * x / (2 * yi^2 + x / yi)).


//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");
	srand(time(NULL));
	//-------------------------------САМА ПРОГА-------------------------------------

	int x;
	double y, py, z = 1;

	cout << "Введите Х:  ";
	cin >> x;
	y = x;

	py = y;

	while(z > 0.00001)
	{
		py = y;
		y = 0.5 * (y + 3 * x / (2 * y * y + x / y));

		z = y - py;
		if (z < 0)
		{
			z = -z;
		}
	}





	cout << "Корень кубический Х равен:  " << y << endl << endl;

	system("pause");

	return 0;
}
